Revit 2027 API
FamilyInstance.HostFace Property
Property to get the reference to the host face of family instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Reference HostFace { get; }
Public ReadOnly Property HostFace As Reference
	Get
public:
property Reference^ HostFace {
	Reference^ get ();
}
member HostFace : Reference with get
Property Value
Reference
If the instance is placed on a work plane, this property will return the reference to the geometry face underlying the work plane. If the work plane is not referencing other geometry, this property will return null. If the instance is not hosted on a face or work plane, this property will return null.
See Also
Reference
FamilyInstance Class
Autodesk.Revit.DB Namespace